Revit 2027 API
LightGroupManager.GetLightGroupManager Method
 Creates a light group manager object from the given document
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static LightGroupManager GetLightGroupManager(
	Document document
)
Public Shared Function GetLightGroupManager (
	document As Document
) As LightGroupManager
public:
static LightGroupManager^ GetLightGroupManager(
	Document^ document
)
static member GetLightGroupManager :
        document : Document -> LightGroupManager
Parameters
document Document
 The document the manager is from
Return Value
LightGroupManager
 The newly created Light group manager object
Exceptions
Exception | Condition
ArgumentException |  The document is not valid because it is not a project (rvt) document
ArgumentNullException |  A non-optional argument was null
See Also
Reference
LightGroupManager Class
Autodesk.Revit.DB.Lighting Namespace